Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_ioctl.c
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 *  Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
 */

/*
 * mcxnex_ioctl.c
 *    Mcxnex IOCTL Routines
 *
 *    Implements all ioctl access into the driver.  This includes all routines
 *    necessary for updating firmware, accessing the mcxnex flash device, and
 *    providing interfaces for VTS.
 */

#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
#include <sys/modctl.h>
#include <sys/file.h>

#include "mcxnex.h"

/* mcxnex HCA state pointer (extern) */
extern void	*mcxnex_statep;
extern int mcxnex_verbose;

#define	DO_WRCONF	1
static int do_bar0 = 1;

/*
 * The ioctl declarations (for firmware flash burning, register read/write
 * (DEBUG-only), and VTS interfaces)
 */
static int mcxnex_ioctl_flash_read(mcxnex_state_t *state, dev_t dev,
    intptr_t arg, int mode);
static int mcxnex_ioctl_flash_write(mcxnex_state_t *state, dev_t dev,
    intptr_t arg, int mode);
static int mcxnex_ioctl_flash_erase(mcxnex_state_t *state, dev_t dev,
    intptr_t arg, int mode);
static int mcxnex_ioctl_flash_init(mcxnex_state_t *state, dev_t dev,
    intptr_t arg, int mode);
static int mcxnex_ioctl_flash_fini(mcxnex_state_t *state, dev_t dev);
static int mcxnex_ioctl_flash_cleanup(mcxnex_state_t *state);
static int mcxnex_ioctl_flash_cleanup_nolock(mcxnex_state_t *state);
#ifdef	DEBUG
static int mcxnex_ioctl_reg_write(mcxnex_state_t *state, intptr_t arg,
    int mode);
static int mcxnex_ioctl_reg_read(mcxnex_state_t *state, intptr_t arg,
    int mode);
#endif	/* DEBUG */
static int mcxnex_ioctl_write_boot_addr(mcxnex_state_t *state, dev_t dev,
    intptr_t arg, int mode);
static int mcxnex_ioctl_info(mcxnex_state_t *state, dev_t dev,
    intptr_t arg, int mode);

/* Hemron Flash Functions */
static void mcxnex_flash_spi_exec_command(mcxnex_state_t *state,
    ddi_acc_handle_t hdl, uint32_t cmd);
static int mcxnex_flash_read_sector(mcxnex_state_t *state,
    uint32_t sector_num);
static int mcxnex_flash_read_quadlet(mcxnex_state_t *state, uint32_t *data,
    uint32_t addr);
static int mcxnex_flash_write_sector(mcxnex_state_t *state,
    uint32_t sector_num);
static int mcxnex_flash_spi_write_dword(mcxnex_state_t *state,
    uint32_t addr, uint32_t data);
static int mcxnex_flash_write_byte(mcxnex_state_t *state, uint32_t addr,
    uchar_t data);
static int mcxnex_flash_erase_sector(mcxnex_state_t *state,
    uint32_t sector_num);
static int mcxnex_flash_erase_chip(mcxnex_state_t *state);
static int mcxnex_flash_bank(mcxnex_state_t *state, uint32_t addr);
static uint32_t mcxnex_flash_read(mcxnex_state_t *state, uint32_t addr,
    int *err);
static void mcxnex_flash_write(mcxnex_state_t *state, uint32_t addr,
    uchar_t data, int *err);
static int mcxnex_flash_spi_wait_wip(mcxnex_state_t *state);
static void mcxnex_flash_spi_write_enable(mcxnex_state_t *state);
static int mcxnex_flash_init(mcxnex_state_t *state);
static int mcxnex_flash_cfi_init(mcxnex_state_t *state, uint32_t *cfi_info,
    int *intel_xcmd);
static int mcxnex_flash_fini(mcxnex_state_t *state);
static int mcxnex_flash_reset(mcxnex_state_t *state);
static uint32_t mcxnex_flash_read_cfg(mcxnex_state_t *state,
    ddi_acc_handle_t pci_config_hdl, uint32_t addr);
#ifdef DO_WRCONF
static void mcxnex_flash_write_cfg(mcxnex_state_t *state,
    ddi_acc_handle_t pci_config_hdl, uint32_t addr, uint32_t data);
static void mcxnex_flash_write_cfg_helper(mcxnex_state_t *state,
    ddi_acc_handle_t pci_config_hdl, uint32_t addr, uint32_t data);
static void mcxnex_flash_write_confirm(mcxnex_state_t *state,
    ddi_acc_handle_t pci_config_hdl);
#endif
static void mcxnex_flash_cfi_byte(uint8_t *ch, uint32_t dword, int i);
static void mcxnex_flash_cfi_dword(uint32_t *dword, uint8_t *ch, int i);

/* Patchable timeout values for flash operations */
int mcxnex_hw_flash_timeout_gpio_sema = MCXNEX_HW_FLASH_TIMEOUT_GPIO_SEMA;
int mcxnex_hw_flash_timeout_config = MCXNEX_HW_FLASH_TIMEOUT_CONFIG;
int mcxnex_hw_flash_timeout_write = MCXNEX_HW_FLASH_TIMEOUT_WRITE;
int mcxnex_hw_flash_timeout_erase = MCXNEX_HW_FLASH_TIMEOUT_ERASE;

/*
 * mcxnex_ioctl()
 */
/* ARGSUSED */
int
mcxnex_ioctl(dev_t dev, int cmd, intptr_t arg, int mode, cred_t *credp,
    int *rvalp)
{
	mcxnex_state_t	*state;
	minor_t		instance;
	int		status;

	if (drv_priv(credp) != 0) {
		return (EPERM);
	}

	instance = MCXNEX_DEV_INSTANCE(dev);
	if (instance == (minor_t)-1) {
		return (EBADF);
	}

	state = ddi_get_soft_state(mcxnex_statep, instance);
	if (state == NULL) {
		return (EBADF);
	}

	status = 0;

	switch (cmd) {
	case HERMON_IOCTL_FLASH_READ:
		status = mcxnex_ioctl_flash_read(state, dev, arg, mode);
		break;

	case HERMON_IOCTL_FLASH_WRITE:
		status = mcxnex_ioctl_flash_write(state, dev, arg, mode);
		break;

	case HERMON_IOCTL_FLASH_ERASE:
		status = mcxnex_ioctl_flash_erase(state, dev, arg, mode);
		break;

	case HERMON_IOCTL_FLASH_INIT:
		status = mcxnex_ioctl_flash_init(state, dev, arg, mode);
		break;

	case HERMON_IOCTL_FLASH_FINI:
		status = mcxnex_ioctl_flash_fini(state, dev);
		break;

	case HERMON_IOCTL_INFO:
		status = mcxnex_ioctl_info(state, dev, arg, mode);
		break;

#ifdef	DEBUG
	case HERMON_IOCTL_REG_WRITE:
		status = mcxnex_ioctl_reg_write(state, arg, mode);
		break;

