Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_ioctl.c
	/* Set the Page Program and execute */
	mcxnex_flash_spi_exec_command(state, hdl,
	    MCXNEX_HW_FLASH_SPI_INSTR_PHASE_OFF |
	    MCXNEX_HW_FLASH_SPI_ADDR_PHASE_OFF |
	    MCXNEX_HW_FLASH_SPI_DATA_PHASE_OFF |
	    MCXNEX_HW_FLASH_SPI_TRANS_SZ_4B |
	    (MCXNEX_HW_FLASH_SPI_PAGE_PROGRAM <<
	    MCXNEX_HW_FLASH_SPI_INSTR_SHIFT));

	/* Wait for write to complete */
	if ((status = mcxnex_flash_spi_wait_wip(state)) != 0) {
		return (status);
	}

	/* the FMA retry loop ends. */
	mcxnex_pio_end(state, hdl, pio_error, fm_loop_cnt, fm_status, fm_test);
	return (0);

pio_error:
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_IOCTL);
	return (EIO);
}

/*
 * mcxnex_flash_write_byte()
 */
static int
mcxnex_flash_write_byte(mcxnex_state_t *state, uint32_t addr, uchar_t data)
{
	uint32_t stat;
	int status = 0;
	int dword_addr;
	int byte_offset;
	int i;
	union {
		uint8_t		bytes[4];
		uint32_t	dword;
	} dword;

	switch (state->hs_fw_cmdset) {
	case HERMON_FLASH_AMD_CMDSET:
		/* Issue Flash Byte program command */
		mcxnex_flash_write(state, addr, 0xAA, &status);
		if (status != 0) {
			return (status);
		}

		mcxnex_flash_write(state, addr, 0x55, &status);
		if (status != 0) {
			return (status);
		}

		mcxnex_flash_write(state, addr, 0xA0, &status);
		if (status != 0) {
			return (status);
		}

		mcxnex_flash_write(state, addr, data, &status);
		if (status != 0) {
			return (status);
		}

		/* Wait for Write Byte to Complete */
		i = 0;
		do {
			drv_usecwait(1);
			stat = mcxnex_flash_read(state, addr & ~3, &status);
			if (status != 0) {
				return (status);
			}

			if (i == mcxnex_hw_flash_timeout_write) {
				cmn_err(CE_WARN,
				    "mcxnex_flash_write_byte: ACS write "
				    "timeout: addr: 0x%x, data: 0x%x\n",
				    addr, data);
				mcxnex_fm_ereport(state, HCA_SYS_ERR,
				    HCA_ERR_IOCTL);
				return (EIO);
			}
			i++;
		} while (data != ((stat >> ((3 - (addr & 3)) << 3)) & 0xFF));

		break;

	case HERMON_FLASH_INTEL_CMDSET:
		/* Issue Flash Byte program command */
		mcxnex_flash_write(state, addr, MCXNEX_HW_FLASH_ICS_WRITE,
		    &status);
		if (status != 0) {
			return (status);
		}
		mcxnex_flash_write(state, addr, data, &status);
		if (status != 0) {
			return (status);
		}

		/* Wait for Write Byte to Complete */
		i = 0;
		do {
			drv_usecwait(1);
			stat = mcxnex_flash_read(state, addr & ~3, &status);
			if (status != 0) {
				return (status);
			}

			if (i == mcxnex_hw_flash_timeout_write) {
				cmn_err(CE_WARN,
				    "mcxnex_flash_write_byte: ICS write "
				    "timeout: addr: %x, data: %x\n",
				    addr, data);
				mcxnex_fm_ereport(state, HCA_SYS_ERR,
				    HCA_ERR_IOCTL);
				return (EIO);
			}
			i++;
		} while ((stat & MCXNEX_HW_FLASH_ICS_READY) == 0);

		if (stat & MCXNEX_HW_FLASH_ICS_ERROR) {
			cmn_err(CE_WARN,
			    "mcxnex_flash_write_byte: ICS write cmd error: "
			    "addr: %x, data: %x\n",
			    addr, data);
			mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_IOCTL);
			return (EIO);
		}
		break;

	case HERMON_FLASH_SPI_CMDSET:
		/*
		 * Our lowest write granularity on SPI is a dword.
		 * To support this ioctl option, we can read in the
		 * dword that contains this byte, modify this byte,
		 * and write the dword back out.
		 */

		/* Determine dword offset and byte offset within the dword */
		byte_offset = addr & 3;
		dword_addr = addr - byte_offset;
#ifdef _LITTLE_ENDIAN
		byte_offset = 3 - byte_offset;
#endif

		/* Read in dword */
		if ((status = mcxnex_flash_read_quadlet(state, &dword.dword,
		    dword_addr)) != 0)
			break;

		/* Set "data" to the appopriate byte */
		dword.bytes[byte_offset] = data;

		/* Write modified dword back out */
		status = mcxnex_flash_spi_write_dword(state, dword_addr,
		    dword.dword);

		break;

	case HERMON_FLASH_UNKNOWN_CMDSET:
	default:
		cmn_err(CE_WARN,
		    "mcxnex_flash_write_byte: unknown cmd set: 0x%x\n",
		    state->hs_fw_cmdset);
		status = EINVAL;
		break;
	}

	return (status);
}

/*
 * mcxnex_flash_erase_sector()
 */
static int
mcxnex_flash_erase_sector(mcxnex_state_t *state, uint32_t sector_num)
{
	ddi_acc_handle_t	hdl;
	uint32_t addr;
	uint32_t stat;
	int status = 0;
	int i;

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test);

	/* Get address from sector num */
	addr = sector_num << state->hs_fw_log_sector_sz;

	switch (state->hs_fw_cmdset) {
	case HERMON_FLASH_AMD_CMDSET:
		/* Issue Flash Sector Erase Command */
		mcxnex_flash_write(state, addr, 0xAA, &status);
		if (status != 0) {
			return (status);
		}

		mcxnex_flash_write(state, addr, 0x55, &status);
		if (status != 0) {
			return (status);
		}

		mcxnex_flash_write(state, addr, 0x80, &status);
		if (status != 0) {
			return (status);
		}

		mcxnex_flash_write(state, addr, 0xAA, &status);
		if (status != 0) {
			return (status);
		}

		mcxnex_flash_write(state, addr, 0x55, &status);
		if (status != 0) {
			return (status);
		}

		mcxnex_flash_write(state, addr, 0x30, &status);
		if (status != 0) {
			return (status);
		}

		/* Wait for Sector Erase to complete */
		i = 0;
		do {
			drv_usecwait(1);
			stat = mcxnex_flash_read(state, addr, &status);
			if (status != 0) {
				return (status);
			}

			if (i == mcxnex_hw_flash_timeout_erase) {
				cmn_err(CE_WARN,
				    "mcxnex_flash_erase_sector: "
				    "ACS erase timeout\n");
				mcxnex_fm_ereport(state, HCA_SYS_ERR,
				    HCA_ERR_IOCTL);
				return (EIO);
			}
			i++;
		} while (stat != 0xFFFFFFFF);
		break;

	case HERMON_FLASH_INTEL_CMDSET:
		/* Issue Flash Sector Erase Command */
		mcxnex_flash_write(state, addr, MCXNEX_HW_FLASH_ICS_ERASE,
		    &status);
		if (status != 0) {
			return (status);
		}

		mcxnex_flash_write(state, addr, MCXNEX_HW_FLASH_ICS_CONFIRM,
		    &status);
		if (status != 0) {
			return (status);
		}

		/* Wait for Sector Erase to complete */
		i = 0;
		do {
			drv_usecwait(1);
			stat = mcxnex_flash_read(state, addr & ~3, &status);
			if (status != 0) {
				return (status);
			}

			if (i == mcxnex_hw_flash_timeout_erase) {
				cmn_err(CE_WARN,
				    "mcxnex_flash_erase_sector: "
				    "ICS erase timeout\n");
				mcxnex_fm_ereport(state, HCA_SYS_ERR,
				    HCA_ERR_IOCTL);
				return (EIO);
			}
			i++;
		} while ((stat & MCXNEX_HW_FLASH_ICS_READY) == 0);

		if (stat & MCXNEX_HW_FLASH_ICS_ERROR) {
			cmn_err(CE_WARN,
			    "mcxnex_flash_erase_sector: "
			    "ICS erase cmd error\n");
			mcxnex_fm_ereport(state, HCA_SYS_ERR,
			    HCA_ERR_IOCTL);
			return (EIO);
		}
		break;

	case HERMON_FLASH_SPI_CMDSET:
		hdl = mcxnex_get_pcihdl(state);

		/* the FMA retry loop starts. */
		mcxnex_pio_start(state, hdl, pio_error, fm_loop_cnt, fm_status,
		    fm_test);

		/* Issue Write Enable */
		mcxnex_flash_spi_write_enable(state);

		/* Set the Address */
		mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_SPI_ADDR,
		    addr & MCXNEX_HW_FLASH_SPI_ADDR_MASK);

		/* Issue Flash Sector Erase */
		mcxnex_flash_spi_exec_command(state, hdl,
		    MCXNEX_HW_FLASH_SPI_INSTR_PHASE_OFF |
		    MCXNEX_HW_FLASH_SPI_ADDR_PHASE_OFF |
		    ((uint32_t)(MCXNEX_HW_FLASH_SPI_SECTOR_ERASE) <<
		    MCXNEX_HW_FLASH_SPI_INSTR_SHIFT));

		/* the FMA retry loop ends. */
		mcxnex_pio_end(state, hdl, pio_error, fm_loop_cnt, fm_status,
		    fm_test);

		/* Wait for Sector Erase to complete */
		status = mcxnex_flash_spi_wait_wip(state);
		break;

	case HERMON_FLASH_UNKNOWN_CMDSET:
	default:
		cmn_err(CE_WARN,
		    "mcxnex_flash_erase_sector: unknown cmd set: 0x%x\n",
		    state->hs_fw_cmdset);
		status = EINVAL;
		break;
	}

	/* Reset the flash device */
	if (status == 0) {
		status = mcxnex_flash_reset(state);
	}
	return (status);

pio_error:
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_IOCTL);
	return (EIO);
}

