Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_ioctl.c
/*
 * mcxnex_flash_erase_chip()
 */
static int
mcxnex_flash_erase_chip(mcxnex_state_t *state)
{
	uint32_t stat;
	uint_t size;
	int status = 0;
	int i;
	int num_sect;

	switch (state->hs_fw_cmdset) {
	case HERMON_FLASH_AMD_CMDSET:
		/* Issue Flash Chip Erase Command */
		mcxnex_flash_write(state, 0, 0xAA, &status);
		if (status != 0) {
			return (status);
		}

		mcxnex_flash_write(state, 0, 0x55, &status);
		if (status != 0) {
			return (status);
		}

		mcxnex_flash_write(state, 0, 0x80, &status);
		if (status != 0) {
			return (status);
		}

		mcxnex_flash_write(state, 0, 0xAA, &status);
		if (status != 0) {
			return (status);
		}

		mcxnex_flash_write(state, 0, 0x55, &status);
		if (status != 0) {
			return (status);
		}

		mcxnex_flash_write(state, 0, 0x10, &status);
		if (status != 0) {
			return (status);
		}

		/* Wait for Chip Erase to Complete */
		i = 0;
		do {
			drv_usecwait(1);
			stat = mcxnex_flash_read(state, 0, &status);
			if (status != 0) {
				return (status);
			}

			if (i == mcxnex_hw_flash_timeout_erase) {
				cmn_err(CE_WARN,
				    "mcxnex_flash_erase_chip: erase timeout\n");
				mcxnex_fm_ereport(state, HCA_SYS_ERR,
				    HCA_ERR_IOCTL);
				return (EIO);
			}
			i++;
		} while (stat != 0xFFFFFFFF);
		break;

	case HERMON_FLASH_INTEL_CMDSET:
	case HERMON_FLASH_SPI_CMDSET:
		/*
		 * These chips don't have a chip erase command, so erase
		 * all blocks one at a time.
		 */
		size = (0x1 << state->hs_fw_log_sector_sz);
		num_sect = state->hs_fw_device_sz / size;

		for (i = 0; i < num_sect; i++) {
			status = mcxnex_flash_erase_sector(state, i);
			if (status != 0) {
				cmn_err(CE_WARN,
				    "mcxnex_flash_erase_chip: "
				    "sector %d erase error\n", i);
				return (status);
			}
		}
		break;

	case HERMON_FLASH_UNKNOWN_CMDSET:
	default:
		cmn_err(CE_WARN, "mcxnex_flash_erase_chip: "
		    "unknown cmd set: 0x%x\n", state->hs_fw_cmdset);
		status = EINVAL;
		break;
	}

	return (status);
}

/*
 * mcxnex_flash_spi_write_enable()
 */
static void
mcxnex_flash_spi_write_enable(mcxnex_state_t *state)
{
	ddi_acc_handle_t	hdl;

	hdl = mcxnex_get_pcihdl(state);

	mcxnex_flash_spi_exec_command(state, hdl,
	    MCXNEX_HW_FLASH_SPI_INSTR_PHASE_OFF |
	    (MCXNEX_HW_FLASH_SPI_WRITE_ENABLE <<
	    MCXNEX_HW_FLASH_SPI_INSTR_SHIFT));
}

/*
 * mcxnex_flash_spi_wait_wip()
 */
static int
mcxnex_flash_spi_wait_wip(mcxnex_state_t *state)
{
	ddi_acc_handle_t	hdl;
	uint32_t		status;

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test);

	hdl = mcxnex_get_pcihdl(state);

	/* the FMA retry loop starts. */
	mcxnex_pio_start(state, hdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test);

	/* wait on the gateway to clear busy */
	do {
		status = mcxnex_flash_read_cfg(state, hdl,
		    MCXNEX_HW_FLASH_SPI_GW);
	} while (status & MCXNEX_HW_FLASH_SPI_BUSY);

	/* now, get the status and check for WIP to clear */
	do {
		mcxnex_flash_spi_exec_command(state, hdl,
		    MCXNEX_HW_FLASH_SPI_READ_OP |
		    MCXNEX_HW_FLASH_SPI_INSTR_PHASE_OFF |
		    MCXNEX_HW_FLASH_SPI_DATA_PHASE_OFF |
		    MCXNEX_HW_FLASH_SPI_TRANS_SZ_4B |
		    (MCXNEX_HW_FLASH_SPI_READ_STATUS_REG <<
		    MCXNEX_HW_FLASH_SPI_INSTR_SHIFT));

		status = mcxnex_flash_read_cfg(state, hdl,
		    MCXNEX_HW_FLASH_SPI_DATA);
	} while (status & MCXNEX_HW_FLASH_SPI_WIP);

	/* the FMA retry loop ends. */
	mcxnex_pio_end(state, hdl, pio_error, fm_loop_cnt, fm_status, fm_test);
	return (0);

pio_error:
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_IOCTL);
	return (EIO);
}

/*
 * mcxnex_flash_bank()
 */
static int
mcxnex_flash_bank(mcxnex_state_t *state, uint32_t addr)
{
	ddi_acc_handle_t	hdl;
	uint32_t		bank;

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test);

	/* Set handle */
	hdl = mcxnex_get_pcihdl(state);

	/* Determine the bank setting from the address */
	bank = addr & MCXNEX_HW_FLASH_BANK_MASK;

	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(state->hs_fw_flashbank))

	/*
	 * If the bank is different from the currently set bank, we need to
	 * change it.  Also, if an 'addr' of 0 is given, this allows the
	 * capability to force the flash bank to 0.  This is useful at init
	 * time to initially set the bank value
	 */
	if (state->hs_fw_flashbank != bank || addr == 0) {
		switch (state->hs_fw_cmdset) {
		case HERMON_FLASH_SPI_CMDSET:
			/* CMJ: not needed for mcxnex */
			break;

		case HERMON_FLASH_INTEL_CMDSET:
		case HERMON_FLASH_AMD_CMDSET:
			/* the FMA retry loop starts. */
			mcxnex_pio_start(state, hdl, pio_error, fm_loop_cnt,
			    fm_status, fm_test);

			mcxnex_flash_write_cfg(state, hdl,
			    MCXNEX_HW_FLASH_GPIO_DATACLEAR, 0x70);
			mcxnex_flash_write_cfg(state, hdl,
			    MCXNEX_HW_FLASH_GPIO_DATASET, (bank >> 15) & 0x70);

			/* the FMA retry loop ends. */
			mcxnex_pio_end(state, hdl, pio_error, fm_loop_cnt,
			    fm_status, fm_test);
			break;

		case HERMON_FLASH_UNKNOWN_CMDSET:
		default:
			return (EINVAL);
		}

		state->hs_fw_flashbank = bank;
	}
	return (0);

pio_error:
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_IOCTL);
	return (EIO);
}

/*
 * mcxnex_flash_spi_exec_command()
 */
static void
mcxnex_flash_spi_exec_command(mcxnex_state_t *state, ddi_acc_handle_t hdl,
    uint32_t cmd)
{
	uint32_t data;
	int timeout = 0;

	cmd |= MCXNEX_HW_FLASH_SPI_BUSY | MCXNEX_HW_FLASH_SPI_ENABLE_OFF;

	mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_SPI_GW, cmd);

	do {
		data = mcxnex_flash_read_cfg(state, hdl,
		    MCXNEX_HW_FLASH_SPI_GW);
		timeout++;
	} while ((data & MCXNEX_HW_FLASH_SPI_BUSY) &&
	    (timeout < mcxnex_hw_flash_timeout_config));
}

/*
 * mcxnex_flash_read()
 */
static uint32_t
mcxnex_flash_read(mcxnex_state_t *state, uint32_t addr, int *err)
{
	ddi_acc_handle_t	hdl;
	uint32_t		data = 0;
	int			timeout, status = 0;

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test);

	hdl = mcxnex_get_pcihdl(state);

	/* the FMA retry loop starts. */
	mcxnex_pio_start(state, hdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test);

	switch (state->hs_fw_cmdset) {
	case HERMON_FLASH_SPI_CMDSET:
		/* Set the transaction address */
		mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_SPI_ADDR,
		    (addr & MCXNEX_HW_FLASH_SPI_ADDR_MASK));

		mcxnex_flash_spi_exec_command(state, hdl,
		    MCXNEX_HW_FLASH_SPI_READ_OP |
		    MCXNEX_HW_FLASH_SPI_INSTR_PHASE_OFF |
		    MCXNEX_HW_FLASH_SPI_ADDR_PHASE_OFF |
		    MCXNEX_HW_FLASH_SPI_DATA_PHASE_OFF |
		    MCXNEX_HW_FLASH_SPI_TRANS_SZ_4B |
		    (MCXNEX_HW_FLASH_SPI_READ <<
		    MCXNEX_HW_FLASH_SPI_INSTR_SHIFT));

		data = mcxnex_flash_read_cfg(state, hdl,
		    MCXNEX_HW_FLASH_SPI_DATA);
		break;

	case HERMON_FLASH_INTEL_CMDSET:
	case HERMON_FLASH_AMD_CMDSET:
		/*
		 * The Read operation does the following:
		 *   1) Write the masked address to the HERMON_FLASH_ADDR
		 *	register. Only the least significant 19 bits are valid.
		 *   2) Read back the register until the command has completed.
		 *   3) Read the data retrieved from the address at the
		 *	HERMON_FLASH_DATA register.
		 */
		mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_ADDR,
		    (addr & MCXNEX_HW_FLASH_ADDR_MASK) | (1 << 29));

		timeout = 0;
		do {
			data = mcxnex_flash_read_cfg(state, hdl,
			    MCXNEX_HW_FLASH_ADDR);
			timeout++;
		} while ((data & MCXNEX_HW_FLASH_CMD_MASK) &&
		    (timeout < mcxnex_hw_flash_timeout_config));

		data = mcxnex_flash_read_cfg(state, hdl, MCXNEX_HW_FLASH_DATA);
		break;

	case HERMON_FLASH_UNKNOWN_CMDSET:
	default:
		cmn_err(CE_CONT, "mcxnex_flash_read: unknown cmdset: 0x%x\n",
		    state->hs_fw_cmdset);
		status = EINVAL;
		break;
	}

	if (timeout == mcxnex_hw_flash_timeout_config) {
		cmn_err(CE_WARN, "mcxnex_flash_read: command timed out.\n");
		*err = EIO;
		mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_IOCTL);
		return (data);
	}

	/* the FMA retry loop ends. */
	mcxnex_pio_end(state, hdl, pio_error, fm_loop_cnt, fm_status, fm_test);
	*err = status;
	return (data);

pio_error:
	*err = EIO;
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_IOCTL);
	return (data);
}

