Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_ioctl.c
/*
 * mcxnex_flash_write()
 */
static void
mcxnex_flash_write(mcxnex_state_t *state, uint32_t addr, uchar_t data, int *err)
{
	ddi_acc_handle_t	hdl;
	int			cmd;
	int			timeout;

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test);

	hdl = mcxnex_get_pcihdl(state);

	/* the FMA retry loop starts. */
	mcxnex_pio_start(state, hdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test);

	/*
	 * The Write operation does the following:
	 *   1) Write the data to be written to the HERMON_FLASH_DATA offset.
	 *   2) Write the address to write the data to to the HERMON_FLASH_ADDR
	 *	offset.
	 *   3) Wait until the write completes.
	 */

	mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_DATA, data << 24);
	mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_ADDR,
	    (addr & 0x7FFFF) | (2 << 29));

	timeout = 0;
	do {
		cmd = mcxnex_flash_read_cfg(state, hdl, MCXNEX_HW_FLASH_ADDR);
		timeout++;
	} while ((cmd & MCXNEX_HW_FLASH_CMD_MASK) &&
	    (timeout < mcxnex_hw_flash_timeout_config));

	if (timeout == mcxnex_hw_flash_timeout_config) {
		cmn_err(CE_WARN, "mcxnex_flash_write: config cmd timeout.\n");
		*err = EIO;
		mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_IOCTL);
		return;
	}

	/* the FMA retry loop ends. */
	mcxnex_pio_end(state, hdl, pio_error, fm_loop_cnt, fm_status, fm_test);
	*err = 0;
	return;

pio_error:
	*err = EIO;
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_IOCTL);
}

/*
 * mcxnex_flash_init()
 */
static int
mcxnex_flash_init(mcxnex_state_t *state)
{
	uint32_t		word;
	ddi_acc_handle_t	hdl;
	int			sema_cnt;
	int			gpio;

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test);

	/* Set handle */
	hdl = mcxnex_get_pcihdl(state);

	/* the FMA retry loop starts. */
	mcxnex_pio_start(state, hdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test);

	/* Init the flash */

#ifdef DO_WRCONF
	/*
	 * Grab the WRCONF semaphore.
	 */
	word = mcxnex_flash_read_cfg(state, hdl, MCXNEX_HW_FLASH_WRCONF_SEMA);
#endif

	/*
	 * Grab the GPIO semaphore.  This allows us exclusive access to the
	 * GPIO settings on the Mcxnex for the duration of the flash burning
	 * procedure.
	 */
	sema_cnt = 0;
	do {
		word = mcxnex_flash_read_cfg(state, hdl,
		    MCXNEX_HW_FLASH_GPIO_SEMA);
		if (word == 0) {
			break;
		}

		sema_cnt++;
		drv_usecwait(1);

	} while (sema_cnt < mcxnex_hw_flash_timeout_gpio_sema);

	/*
	 * Determine if we timed out trying to grab the GPIO semaphore
	 */
	if (sema_cnt == mcxnex_hw_flash_timeout_gpio_sema) {
		cmn_err(CE_WARN, "mcxnex_flash_init: GPIO SEMA timeout\n");
		cmn_err(CE_WARN, "GPIO_SEMA value: 0x%x\n", word);
		mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_IOCTL);
		return (EIO);
	}

	/* Save away original GPIO Values */
	state->hs_fw_gpio[0] = mcxnex_flash_read_cfg(state, hdl,
	    MCXNEX_HW_FLASH_GPIO_DATA);

	/* Set new GPIO value */
	gpio = state->hs_fw_gpio[0] | MCXNEX_HW_FLASH_GPIO_PIN_ENABLE;
	mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_GPIO_DATA, gpio);

	/* Save away original GPIO Values */
	state->hs_fw_gpio[1] = mcxnex_flash_read_cfg(state, hdl,
	    MCXNEX_HW_FLASH_GPIO_MOD0);
	state->hs_fw_gpio[2] = mcxnex_flash_read_cfg(state, hdl,
	    MCXNEX_HW_FLASH_GPIO_MOD1);

	/* unlock GPIO */
	mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_GPIO_LOCK,
	    MCXNEX_HW_FLASH_GPIO_UNLOCK_VAL);

	/*
	 * Set new GPIO values
	 */
	gpio = state->hs_fw_gpio[1] | MCXNEX_HW_FLASH_GPIO_PIN_ENABLE;
	mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_GPIO_MOD0, gpio);

	gpio = state->hs_fw_gpio[2] & ~MCXNEX_HW_FLASH_GPIO_PIN_ENABLE;
	mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_GPIO_MOD1, gpio);

	/* re-lock GPIO */
	mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_GPIO_LOCK, 0);

	/* Set CPUMODE to enable mcxnex to access the flash device */
	/* CMJ This code came from arbel.  Mcxnex doesn't seem to need it. */
	/*
	 *	mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_CPUMODE,
	 *	    1 << MCXNEX_HW_FLASH_CPU_SHIFT);
	 */

	/* the FMA retry loop ends. */
	mcxnex_pio_end(state, hdl, pio_error, fm_loop_cnt, fm_status, fm_test);
	return (0);

pio_error:
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_IOCTL);
	return (EIO);
}

/*
 * mcxnex_flash_cfi_init
 *   Implements access to the CFI (Common Flash Interface) data
 */
static int
mcxnex_flash_cfi_init(mcxnex_state_t *state, uint32_t *cfi_info,
    int *intel_xcmd)
{
	uint32_t	data;
	uint32_t	sector_sz_bytes;
	uint32_t	bit_count;
	uint8_t		cfi_ch_info[HERMON_CFI_INFO_SIZE];
	uint32_t	cfi_dw_info[HERMON_CFI_INFO_QSIZE];
	int		i;
	int		status;

	/* Right now, all mcxnex cards use SPI. */
	if (MCXNEX_IS_MAINTENANCE_MODE(state->hs_dip) ||
	    MCXNEX_IS_HCA_MODE(state->hs_dip)) {
		/*
		 * Don't use CFI for SPI part. Just fill in what we need
		 * and return.
		 */
		state->hs_fw_cmdset = HERMON_FLASH_SPI_CMDSET;
		state->hs_fw_log_sector_sz = HERMON_FLASH_SPI_LOG_SECTOR_SIZE;
		state->hs_fw_device_sz = HERMON_FLASH_SPI_DEVICE_SIZE;

		/*
		 * set this to inform caller of cmdset type.
		 */
		cfi_ch_info[0x13] = HERMON_FLASH_SPI_CMDSET;
		mcxnex_flash_cfi_dword(&cfi_info[4], cfi_ch_info, 0x10);
		return (0);
	}

	/*
	 * Determine if the user command supports the Intel Extended
	 * Command Set. The query string is contained in the fourth
	 * quad word.
	 */
	mcxnex_flash_cfi_byte(cfi_ch_info, cfi_info[0x04], 0x10);
	if (cfi_ch_info[0x10] == 'M' &&
	    cfi_ch_info[0x11] == 'X' &&
	    cfi_ch_info[0x12] == '2') {
		*intel_xcmd = 1; /* support is there */
		if (mcxnex_verbose) {
			cmn_err(CE_CONT, "?Support for Intel X is present\n");
		}
	}

	/* CFI QUERY */
	mcxnex_flash_write(state, 0x55, HERMON_FLASH_CFI_INIT, &status);
	if (status != 0) {
		return (status);
	}

	/* temporarily set the cmdset in order to do the initial read */
	state->hs_fw_cmdset = HERMON_FLASH_INTEL_CMDSET;

	/* Read in CFI data */
	for (i = 0; i < HERMON_CFI_INFO_SIZE; i += 4) {
		data = mcxnex_flash_read(state, i, &status);
		if (status != 0) {
			return (status);
		}
		cfi_dw_info[i >> 2] = data;
		mcxnex_flash_cfi_byte(cfi_ch_info, data, i);
	}

