Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_ioctl.c
	/* Determine chip set */
	state->hs_fw_cmdset = HERMON_FLASH_UNKNOWN_CMDSET;
	if (cfi_ch_info[0x20] == 'Q' &&
	    cfi_ch_info[0x22] == 'R' &&
	    cfi_ch_info[0x24] == 'Y') {
		/*
		 * Mode: x16 working in x8 mode (Intel).
		 * Pack data - skip spacing bytes.
		 */
		if (mcxnex_verbose) {
			cmn_err(CE_CONT, "?x16 working in x8 mode (Intel)\n");
		}
		for (i = 0; i < HERMON_CFI_INFO_SIZE; i += 2) {
			cfi_ch_info[i/2] = cfi_ch_info[i];
		}
	}
	state->hs_fw_cmdset = cfi_ch_info[0x13];

	if (state->hs_fw_cmdset != HERMON_FLASH_INTEL_CMDSET &&
	    state->hs_fw_cmdset != HERMON_FLASH_AMD_CMDSET) {
		cmn_err(CE_WARN, "UNKNOWN chip cmd set 0x%04x",
		    state->hs_fw_cmdset);
		state->hs_fw_cmdset = HERMON_FLASH_UNKNOWN_CMDSET;
		return (0);
	}

	/* Determine total bytes in one sector size */
	sector_sz_bytes = ((cfi_ch_info[0x30] << 8) | cfi_ch_info[0x2F]) << 8;

	/* Calculate equivalent of log2 (n) */
	for (bit_count = 0; sector_sz_bytes > 1; bit_count++) {
		sector_sz_bytes >>= 1;
	}

	/* Set sector size */
	state->hs_fw_log_sector_sz = bit_count;

	/* Set flash size */
	state->hs_fw_device_sz = 0x1 << cfi_ch_info[0x27];

	/* Reset to turn off CFI mode */
	if ((status = mcxnex_flash_reset(state)) != 0)
		goto out;

	/* Pass CFI data back to user command. */
	for (i = 0; i < HERMON_FLASH_CFI_SIZE_QUADLET; i++) {
		mcxnex_flash_cfi_dword(&cfi_info[i], cfi_ch_info, i << 2);
	}

	if (*intel_xcmd == 1) {
		/*
		 * Inform the user cmd that this driver does support the
		 * Intel Extended Command Set.
		 */
		cfi_ch_info[0x10] = 'M';
		cfi_ch_info[0x11] = 'X';
		cfi_ch_info[0x12] = '2';
	} else {
		cfi_ch_info[0x10] = 'Q';
		cfi_ch_info[0x11] = 'R';
		cfi_ch_info[0x12] = 'Y';
	}
	cfi_ch_info[0x13] = state->hs_fw_cmdset;
	mcxnex_flash_cfi_dword(&cfi_info[0x4], cfi_ch_info, 0x10);
out:
	return (status);
}

/*
 * mcxnex_flash_fini()
 */
static int
mcxnex_flash_fini(mcxnex_state_t *state)
{
	int status;
	ddi_acc_handle_t hdl;

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test);

	/* Set handle */
	hdl = mcxnex_get_pcihdl(state);

	if ((status = mcxnex_flash_bank(state, 0)) != 0)
		return (status);

	/* the FMA retry loop starts. */
	mcxnex_pio_start(state, hdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test);

	/*
	 * Restore original GPIO Values
	 */
	mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_GPIO_DATA,
	    state->hs_fw_gpio[0]);

	/* unlock GPIOs */
	mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_GPIO_LOCK,
	    MCXNEX_HW_FLASH_GPIO_UNLOCK_VAL);

	mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_GPIO_MOD0,
	    state->hs_fw_gpio[1]);
	mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_GPIO_MOD1,
	    state->hs_fw_gpio[2]);

	/* re-lock GPIOs */
	mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_GPIO_LOCK, 0);

	/* Give up gpio semaphore */
	mcxnex_flash_write_cfg(state, hdl, MCXNEX_HW_FLASH_GPIO_SEMA, 0);

	/* the FMA retry loop ends. */
	mcxnex_pio_end(state, hdl, pio_error, fm_loop_cnt, fm_status, fm_test);
	return (0);

pio_error:
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_IOCTL);
	return (EIO);
}

/*
 * mcxnex_flash_read_cfg
 */
static uint32_t
mcxnex_flash_read_cfg(mcxnex_state_t *state, ddi_acc_handle_t pci_config_hdl,
    uint32_t addr)
{
	uint32_t	read;

	if (do_bar0) {
		read = ddi_get32(mcxnex_get_cmdhdl(state), (uint32_t *)(void *)
		    (state->hs_reg_cmd_baseaddr + addr));
	} else {
		/*
		 * Perform flash read operation:
		 *   1) Place addr to read from on the MCXNEX_HW_FLASH_CFG_ADDR
		 *	register
		 *   2) Read data at that addr from the MCXNEX_HW_FLASH_CFG_DATA
		 *	 register
		 */
		pci_config_put32(pci_config_hdl, MCXNEX_HW_FLASH_CFG_ADDR,
		    addr);
		read = pci_config_get32(pci_config_hdl,
		    MCXNEX_HW_FLASH_CFG_DATA);
	}

	return (read);
}

#ifdef DO_WRCONF
static void
mcxnex_flash_write_cfg(mcxnex_state_t *state,
    ddi_acc_handle_t pci_config_hdl, uint32_t addr, uint32_t data)
{
	mcxnex_flash_write_cfg_helper(state, pci_config_hdl, addr, data);
	mcxnex_flash_write_confirm(state, pci_config_hdl);
}

static void
mcxnex_flash_write_confirm(mcxnex_state_t *state,
    ddi_acc_handle_t pci_config_hdl)
{
	uint32_t	sem_value = 1;

	mcxnex_flash_write_cfg_helper(state, pci_config_hdl,
	    MCXNEX_HW_FLASH_WRCONF_SEMA, 0);
	while (sem_value) {
		sem_value = mcxnex_flash_read_cfg(state, pci_config_hdl,
		    MCXNEX_HW_FLASH_WRCONF_SEMA);
	}
}
#endif

/*
 * mcxnex_flash_write_cfg
 */
static void
#ifdef DO_WRCONF
mcxnex_flash_write_cfg_helper(mcxnex_state_t *state,
    ddi_acc_handle_t pci_config_hdl, uint32_t addr, uint32_t data)
#else
mcxnex_flash_write_cfg(mcxnex_state_t *state,
    ddi_acc_handle_t pci_config_hdl, uint32_t addr, uint32_t data)
#endif
{
	if (do_bar0) {
		ddi_put32(mcxnex_get_cmdhdl(state), (uint32_t *)(void *)
		    (state->hs_reg_cmd_baseaddr + addr), data);

	} else {

		/*
		 * Perform flash write operation:
		 *   1) Place addr to write to on the MCXNEX_HW_FLASH_CFG_ADDR
		 *	register
		 *   2) Place data to write on to the MCXNEX_HW_FLASH_CFG_DATA
		 *	register
		 */
		pci_config_put32(pci_config_hdl, MCXNEX_HW_FLASH_CFG_ADDR,
		    addr);
		pci_config_put32(pci_config_hdl, MCXNEX_HW_FLASH_CFG_DATA,
		    data);
	}
}

/*
 * Support routines to convert Common Flash Interface (CFI) data
 * from a 32  bit word to a char array, and from a char array to
 * a 32 bit word.
 */
static void
mcxnex_flash_cfi_byte(uint8_t *ch, uint32_t dword, int i)
{
	ch[i] = (uint8_t)((dword & 0xFF000000) >> 24);
	ch[i+1] = (uint8_t)((dword & 0x00FF0000) >> 16);
	ch[i+2] = (uint8_t)((dword & 0x0000FF00) >> 8);
	ch[i+3] = (uint8_t)((dword & 0x000000FF));
}

static void
mcxnex_flash_cfi_dword(uint32_t *dword, uint8_t *ch, int i)
{
	*dword = (uint32_t)
	    ((uint32_t)ch[i] << 24 |
	    (uint32_t)ch[i+1] << 16 |
	    (uint32_t)ch[i+2] << 8 |
	    (uint32_t)ch[i+3]);
}
